MinhKhanh-EternAI/smart-home-iot/esp8266-core/src/WifiHelper.h
#ifndef WIFI_HELPER_H
#define WIFI_HELPER_H

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <EEPROM.h>
#include <LiquidCrystal_I2C.h>
#include "Config.h"

class WifiHelper {
private:
    static ESP8266WebServer& getServer() {
        static ESP8266WebServer server(80);
        return server;
    }

public:
    static bool& getAPMode() {
        static bool isAPMode = false;
        return isAPMode;
    }

private:

    // Ghi chuỗi vào EEPROM
    static void writeStringToEEPROM(int offset, const String& str) {
        int len = str.length();
        for (int i = 0; i < len; i++) {
            EEPROM.write(offset + i, str[i]);
        }
        EEPROM.write(offset + len, '\0'); // Ký tự kết thúc chuỗi
        EEPROM.commit();
    }

    // Đọc chuỗi từ EEPROM
    static String readStringFromEEPROM(int offset, int maxLen) {
        String str = "";
        for (int i = 0; i < maxLen; i++) {
            char c = EEPROM.read(offset + i);
            if (c == '\0' || c == 0xFF) break;
            str += c;
        }
        return str;
    }

    static void checkWiFiResetButton() {
        pinMode(0, INPUT_PULLUP);
        delay(10);
        if (digitalRead(0) == LOW) {
            Serial.println("[WifiHelper] Phat hien nhan nut BOOT! Giu 3s de reset WiFi...");
            unsigned long pressed = millis();
            while (millis() - pressed < 3000) {
                delay(10);
                if (digitalRead(0) != LOW) {
                    Serial.println("[WifiHelper] Nha nut som -> bo qua.");
                    return;
                }
            }
            Serial.println("[WifiHelper] Xoa WiFi credentials...");
            for (int i = 0; i < EEPROM_SIZE; i++) {
                EEPROM.write(i, 0);
            }
            EEPROM.commit();
            WiFi.disconnect(true);
            Serial.println("[WifiHelper] WiFi da xoa! Nha nut BOOT de reboot...");
            while (digitalRead(0) == LOW) {
                delay(10);
            }
            delay(200);
            Serial.println("[WifiHelper] Dang reboot vao AP mode...");
            ESP.restart();
        }
    }

public:
    static int& getLCDAddress() {
        static int lcdAddress = -1;
        return lcdAddress;
    }

    static LiquidCrystal_I2C& getLCD() {
        static LiquidCrystal_I2C lcd(getLCDAddress() != -1 ? getLCDAddress() : 0x27, 16, 2);
        return lcd;
    }

    static void printToLCD(const String& line1, const String& line2 = "") {
        int addr = getLCDAddress();
        if (addr != -1) {
            if (Serial) Serial.printf("[LCD] Writing -> L1: \"%s\", L2: \"%s\"\n", line1.c_str(), line2.c_str());
            LiquidCrystal_I2C& lcd = getLCD();
            static bool lcdInited = false;
            if (!lcdInited) {
                lcd.init();
                lcd.backlight();
                lcdInited = true;
            }
            lcd.clear();
            lcd.setCursor(0, 0);
            lcd.print(line1.substring(0, 16));
            if (line2.length() > 0) {
                lcd.setCursor(0, 1);
                lcd.print(line2.substring(0, 16));
            }
        } else {
            if (Serial) Serial.printf("[LCD-Skip] LCD not detected. Message: L1: \"%s\", L2: \"%s\"\n", line1.c_str(), line2.c_str());
        }
    }

    // ===== LCD System: Default screen + Notification overlay =====

    // --- Notification state ---
    static String& getNotifLine1() {
        static String line1 = ""; return line1;
    }
    static String& getNotifLine2() {
        static String line2 = ""; return line2;
    }
    static unsigned long& getNotifStart() {
        static unsigned long start = 0; return start;
    }
    static unsigned long& getNotifDuration() {
        static unsigned long dur = 5000; return dur;
    }
    static bool& getHasNotification() {
        static bool has = false; return has;
    }

    // --- Sensor data (fed by ClimateController) ---
    static float& getStandbyTemp() {
        static float t = -999.0f; return t;
    }
    static float& getStandbyHum() {
        static float h = -999.0f; return h;
    }
    static void setStandbyData(float temp, float hum) {
        getStandbyTemp() = temp;
        getStandbyHum() = hum;
    }

    // --- Dirty-check cache to avoid redundant I2C writes ---
    static String& getLastL1() {
        static String s = ""; return s;
    }
    static String& getLastL2() {
        static String s = ""; return s;
    }
    static unsigned long& getLastDefaultUpdate() {
        static unsigned long t = 0; return t;
    }

    // --- Default screen (always: L1=WiFi status, L2=Temp/Hum) ---
    static void showDefaultScreen() {
        if (getAPMode()) {
            String l1 = "AP: " + String(AP_SSID);
            String l2 = "IP: " + WiFi.softAPIP().toString();
            if (l1 != getLastL1() || l2 != getLastL2()) {
                getLastL1() = l1; getLastL2() = l2;
                printToLCD(l1, l2);
            }
            return;
        }

        String l1, l2;
        if (WiFi.status() == WL_CONNECTED) {
            l1 = "WiFi:Connected";
            float t = getStandbyTemp();
            float h = getStandbyHum();
            if (t > -998.0f) {
                char buf[17];
                snprintf(buf, sizeof(buf), "T:%.1fC H:%.0f%%", t, h);
                l2 = String(buf);
            } else {
                l2 = "Smart Home IoT";
            }
        } else {
            l1 = "WiFi Reconnecting...";
            l2 = "";
        }

        if (l1 != getLastL1() || l2 != getLastL2()) {
            getLastL1() = l1; getLastL2() = l2;
            printToLCD(l1, l2);
        }
    }

    // --- Notification overlay (5s then revert to default) ---
    static void showNotification(const String& line1, const String& line2, unsigned long durationMs = 5000) {
        getNotifLine1() = line1;
        getNotifLine2() = line2;
        getNotifStart() = millis();
        getNotifDuration() = durationMs;
        getHasNotification() = true;
        getLastL1() = line1;
        getLastL2() = line2;
        printToLCD(line1, line2);
    }

    // --- Called every loop: handles notification timeout + periodic default refresh ---
    static void updateLCD() {
        unsigned long now = millis();
        if (getHasNotification()) {
            if (now - getNotifStart() >= getNotifDuration()) {
                getHasNotification() = false;
                getLastL1() = "";
                getLastL2() = "";
                showDefaultScreen();
            }
        } else {
            if (now - getLastDefaultUpdate() >= 2000) {
                getLastDefaultUpdate() = now;
                showDefaultScreen();
            }
        }
    }

