MinhKhanh-EternAI/smart-home-iot/esp8266-core/src/WifiHelper.h
            // Lưu vào EEPROM
            writeStringToEEPROM(0, ssid);
            writeStringToEEPROM(32, password);
            
            getServer().send(200, "application/json", "{\"status\":\"ok\"}");
            
            // Hiển thị LCD thông báo lưu thành công và khởi động lại
            printToLCD("WiFi Config Saved", "Rebooting...");
            
            delay(2000);
            ESP.restart();
        });

        // Endpoint xóa WiFi (factory reset)
        server.on("/reset", HTTP_GET, []() {
            String html = "<!DOCTYPE html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width, initial-scale=1'><title>Reset WiFi</title><style>body{font-family:sans-serif;background:#0f172a;color:#f8fafc;display:flex;align-items:center;justify-content:center;height:100vh;}.card{background:#1e293b;padding:32px;border-radius:16px;text-align:center;max-width:400px;}.btn{background:#ef4444;color:white;border:0;padding:12px 24px;border-radius:8px;cursor:pointer;font-size:16px;margin-top:16px;}.btn:hover{background:#dc2626;}</style></head><body><div class='card'><h2>Reset WiFi?</h2><p>Thiet bi se xoa WiFi va khoi dong lai.</p><button class='btn' onclick='fetch(\"/reset\",{method:\"POST\"}).then(()=>alert(\"WiFi da xoa! Dang reboot...\"));'>Xac nhan Reset</button></div></body></html>";
            getServer().send(200, "text/html", html);
        });
        server.on("/reset", HTTP_POST, []() {
            getServer().send(200, "application/json", "{\"status\":\"ok\"}");
            printToLCD("WiFi Reset!", "Rebooting...");
            for (int i = 0; i < EEPROM_SIZE; i++) EEPROM.write(i, 0);
            EEPROM.commit();
            WiFi.disconnect(true);
            delay(1000);
            ESP.restart();
        });

        server.begin();
        Serial.println("Web Server initialized and listening on port 80.");
    }

    static void handleClient() {
        if (getAPMode()) {
            getServer().handleClient();
        }
    }

    static void keepAlive() {
        // Chỉ chạy keepAlive khi không ở chế độ cấu hình AP
        if (!getAPMode() && WiFi.status() != WL_CONNECTED) {
            static unsigned long lastReconnectAttempt = 0;
            unsigned long now = millis();
            if (now - lastReconnectAttempt > 15000) { // Thử kết nối lại mỗi 15 giây
                lastReconnectAttempt = now;
                if (Serial) Serial.println("WiFi disconnected. Reconnecting...");
                
                String savedSSID = readStringFromEEPROM(0, 32);
                String savedPass = readStringFromEEPROM(32, 64);
                
                if (savedSSID.length() > 0 && savedSSID != "Your_SSID" && (unsigned char)savedSSID[0] != 0xFF) {
                    WiFi.begin(savedSSID.c_str(), savedPass.c_str());
                }
            }
        }
    }

    static void checkResetButton() {
        static bool wasPressed = false;
        static unsigned long pressedTime = 0;
        static unsigned long lastDebounceTime = 0;
        static bool lastReading = HIGH;
        static int lastReportedSec = 0;
        static bool pinInitialized = false;

        if (!pinInitialized) {
            pinMode(0, INPUT_PULLUP);
            pinInitialized = true;
        }

        bool reading = digitalRead(0);

        if (reading != lastReading) {
            lastDebounceTime = millis();
        }
        lastReading = reading;

        if (millis() - lastDebounceTime < 50) return;

        if (reading == LOW) {
            if (!wasPressed) {
                wasPressed = true;
                pressedTime = millis();
                lastReportedSec = 0;
                if (Serial) Serial.println("[WifiHelper] Nut FLASH nhan! Giu 5s de reset WiFi...");
                printToLCD("Giu FLASH 5s", "de reset WiFi");
            } else {
                int sec = (millis() - pressedTime) / 1000;
                if (sec > lastReportedSec && sec < 5) {
                    lastReportedSec = sec;
                    if (Serial) Serial.printf("[WifiHelper] Con %ds...\n", 5 - sec);
                    printToLCD("Giu FLASH 5s", String(5 - sec) + "s con lai...");
                }
            }
        } else {
            if (wasPressed) {
                wasPressed = false;
                if (Serial) Serial.println("[WifiHelper] Nha nut som -> bo qua.");
                printToLCD("Da huy", "");
            }
        }

        if (wasPressed && (millis() - pressedTime >= 5000)) {
            if (Serial) Serial.println("[WifiHelper] Reset WiFi! Xoa credentials...");
            printToLCD("Dang xoa WiFi...", "Rebooting...");
            for (int i = 0; i < EEPROM_SIZE; i++) {
                EEPROM.write(i, 0);
            }
            EEPROM.commit();
            WiFi.disconnect(true);
            delay(1000);
            ESP.restart();
        }
    }
};

#endif // WIFI_HELPER_H
